In [328]:
5+3

8

In [329]:
7*3

21

In [330]:
5-3

2

In [331]:
print("hello")

hello

In [332]:
marks = 78
marks

78

In [333]:
type(marks)

int

In [334]:
print(type(marks))

<class 'int'>

In [335]:
marks = "munesh"
marks

'munesh'

In [336]:
price = 563.23
price
type(price)
price*5

2816.15

In [337]:
price = 523.23
print(price)
print(type(price))
print(price*5)

523.23
<class 'float'>
2616.15

In [338]:
status = True
type(status)

bool

In [339]:
course = "Data science - Module 1 : part 2 "
type(course)

str

In [340]:
range(25,85)

range(25, 85)

In [341]:
print(range(5,10))

range(5, 10)

In [342]:
for donkey in range(5, 10):
    print(donkey)

5
6
7
8
9

In [343]:
# each and everystep should be indented well so the code is work or else it will show error

In [344]:
for monkey in range(10):
    print(monkey)

0
1
2
3
4
5
6
7
8
9

In [345]:
city = "hyderabad - 30"
for ch in city:
    print(ch)

h
y
d
e
r
a
b
a
d

-

3
0

In [346]:
city = "hyderabad - 30"
for ch in city:
    print(ch, end = '')

hyderabad - 30

In [347]:
#list
marks = [23,45,56,86]
marks

[23, 45, 56, 86]

In [348]:
print(type(marks))

<class 'list'>

In [349]:
len(marks)

4

In [350]:
newmarks = sorted(marks)  #creates another sorted list. Original list remains unchanged

In [351]:
newmarks

[23, 45, 56, 86]

In [352]:
marks.sort() # modifies original list

In [353]:
marks

[23, 45, 56, 86]

In [354]:
marks.sort(reverse = True) # it will print in reverse formation 
marks

[86, 56, 45, 23]

In [355]:
marks = [23,56,85,15,45]
marks

[23, 56, 85, 15, 45]

In [356]:
marks.append(92) # add new numbe in the data base
marks

[23, 56, 85, 15, 45, 92]

In [357]:
marks.count(92)

1

In [358]:
marks.reverse()
marks

[92, 45, 15, 85, 56, 23]

In [359]:
marks*3 # it will repeat 3 times as we given *3

[92, 45, 15, 85, 56, 23, 92, 45, 15, 85, 56, 23, 92, 45, 15, 85, 56, 23]

In [360]:
list1 = [2,5,6,3]
list2 = [4,5,9,6]
list1  +  list2 # concatenation of two lists

[2, 5, 6, 3, 4, 5, 9, 6]

In [361]:
(list1 + list2) * 2 #first it will add list1 and list2 and it will excecute into two times after combination of list 1 and 2

[2, 5, 6, 3, 4, 5, 9, 6, 2, 5, 6, 3, 4, 5, 9, 6]

In [362]:
marks = [45,75,87,36,69]
marks

[45, 75, 87, 36, 69]

In [363]:
#indexing starts with 0
marks[4]

69

In [364]:
#slicing
marks[1:4] #with index 1,2,3

[75, 87, 36]

In [365]:
marks[1:]

[75, 87, 36, 69]

In [366]:
marks[:2]

[45, 75]

In [367]:
#negative indexing
marks[-1]

69

In [368]:
marks[:-1]

[45, 75, 87, 36]

In [369]:
marks[-3:]

[87, 36, 69]

In [370]:
numbers = [ 1,2,3,4,5,6,7,8,9,12,13,14,15,16,17,18,19]
numbers[::]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19]

In [371]:
numbers[::5] #starting it will count from 0 and when it ends the given slice after that it will continue from 1

[1, 6, 13, 18]

In [372]:
# [start: stop :step]
numbers[1:15:3]

[2, 5, 8, 13, 16]

In [373]:
len(numbers)

17

In [374]:
#list comprehension
numbers = [4,5,8,9,2]
list = [n**2 for n in numbers]
list1 = [n*2 for n in numbers]
print(list)
print(list1)

[16, 25, 64, 81, 4]
[8, 10, 16, 18, 4]

In [375]:
mark = (1,5,7,3,9)  #tuples cant change the values after assigned 
mark

(1, 5, 7, 3, 9)

In [376]:
markd = {42: 'Mouse',
         25: 'keyboard',
         71: 'monitors',
         77: 'earphones'}
markd

{42: 'Mouse', 25: 'keyboard', 71: 'monitors', 77: 'earphones'}

In [377]:
markd[77]

'earphones'

In [378]:
markd.values()

dict_values(['Mouse', 'keyboard', 'monitors', 'earphones'])

In [379]:
markd.keys()

dict_keys([42, 25, 71, 77])

In [380]:
markd.items()

dict_items([(42, 'Mouse'), (25, 'keyboard'), (71, 'monitors'), (77, 'earphones')])

In [464]:
# Don't use 'list' as a variable name
my_list = range(23, 50)  # Use a different variable name

marks = [85, 90, 78]  # Define marks as a list
mark = 67             # Define mark as a single value

marksd = {
    'A': marks,  
    'B': mark,   
    'C': my_list,
    'D': 6.97
}

print(marksd)

{'A': [85, 90, 78], 'B': 67, 'C': range(23, 50), 'D': 6.97}

In [382]:
marksd['A']

[85, 90, 78]

In [383]:
marksd['A'][2]

78

In [384]:
from math import log
log(6.23)

1.8293763327993617

In [385]:
from math import sin, exp, cos
sin(2.32), cos(5.36), exp(4.56)

(0.7322314440302514, 0.6032828519984039, 95.58347983006624)

In [386]:
from math import *
tan(0.23)

0.23414336235146527

In [387]:
log(63.2)

4.146304301152812

In [465]:
import math
math.log(2.63), math.sin(253), math.sqrt(25)

(0.9669838461896731, 0.9948237286710673, 5.0)

In [389]:
import math as mt # alias (rename)
mt.sqrt(23)

4.795831523312719

In [390]:
dir(math) #it wll show all the function by using dir

['__doc__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'acos',
 'acosh',
 'asin',
 'asinh',
 'atan',
 'atan2',
 'atanh',
 'cbrt',
 'ceil',
 'comb',
 'copysign',
 'cos',
 'cosh',
 'degrees',
 'dist',
 'e',
 'erf',
 'erfc',
 'exp',
 'exp2',
 'expm1',
 'fabs',
 'factorial',
 'floor',
 'fmod',
 'frexp',
 'fsum',
 'gamma',
 'gcd',
 'hypot',
 'inf',
 'isclose',
 'isfinite',
 'isinf',
 'isnan',
 'isqrt',
 'lcm',
 'ldexp',
 'lgamma',
 'log',
 'log10',
 'log1p',
 'log2',
 'modf',
 'nan',
 'nextafter',
 'perm',
 'pi',
 'pow',
 'prod',
 'radians',
 'remainder',
 'sin',
 'sinh',
 'sqrt',
 'tan',
 'tanh',
 'tau',
 'trunc',
 'ulp']

In [466]:
import pandas as pd

# Option 1: Raw string
df = pd.read_csv(r'C:\Users\munes\Dropbox\PC\Documents\assignments\assignments\Salaries.csv')

# Option 2: Forward slashes
# df = pd.read_csv('C:/Users/munes/Dropbox/PC/Documents/assignments/assignments/Salaries.csv')

# Option 3: Double backslashes
# df = pd.read_csv('C:\\Users\\munes\\Dropbox\\PC\\Documents\\assignments\\assignments\\Salaries.csv')

# Display the first few rows of the DataFrame
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [392]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [393]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [394]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [395]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [396]:
df.describe(include = 'all')

        rank discipline        phd    service   sex         salary
count     78         78  78.000000  78.000000    78      78.000000
unique     3          2        NaN        NaN     2            NaN
top     Prof          B        NaN        NaN  Male            NaN
freq      46         42        NaN        NaN    39            NaN
mean     NaN        NaN  19.705128  15.051282   NaN  108023.782051
std      NaN        NaN  12.498425  12.139768   NaN   28293.661022
min      NaN        NaN   1.000000   0.000000   NaN   57800.000000
25%      NaN        NaN  10.250000   5.250000   NaN   88612.500000
50%      NaN        NaN  18.500000  14.500000   NaN  104671.000000
75%      NaN        NaN  27.750000  20.750000   NaN  126774.750000
max      NaN        NaN  56.000000  51.000000   NaN  186960.000000

In [397]:
df.salary.describe()
 #or 
df['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [398]:
df.salary.count()

78

In [467]:
df.salary.mean(numeric_only = "True")

108023.78205128205

In [400]:
df.service.max()

51

In [401]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [402]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [403]:
df.mean(numeric_only = True)

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [404]:
df.std(numeric_only = True)

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [405]:
df.mean(numeric_only = True)

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [406]:
pd.__version__

'2.0.3'

In [407]:
df.salary

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [408]:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [409]:
result1 = df['salary']
result1

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [410]:
type(result1)

pandas.core.series.Series

In [411]:
result2 = df[['salary']]  
result2

    salary
0   186960
1    93000
2   110515
3   131205
4   104800
..     ...
73  105450
74  104542
75  124312
76  109954
77  109646

[78 rows x 1 columns]

In [412]:
result3 = df['salary']
result3

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [413]:
df.sort_values('salary', ascending=True)

         rank discipline  phd  service     sex  salary
9        Prof          A   51       51    Male   57800
54  AssocProf          A   25       22  Female   62884
66   AsstProf          A    7        6  Female   63100
71  AssocProf          B   12        9  Female   71065
57   AsstProf          A    3        1  Female   72500
..        ...        ...  ...      ...     ...     ...
31       Prof          B   22       21    Male  155750
27       Prof          A   45       43    Male  155865
72       Prof          B   24       15  Female  161101
13       Prof          B   35       33    Male  162200
0        Prof          B   56       49    Male  186960

[78 rows x 6 columns]

In [414]:
df.loc[3] #select the row with index label

rank            Prof
discipline         A
phd               40
service           31
sex             Male
salary        131205
Name: 3, dtype: object

In [415]:
df.iloc[5]

rank            Prof
discipline         A
phd               20
service           20
sex             Male
salary        122400
Name: 5, dtype: object

In [416]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [417]:
df.service 
#or
df[['service']]

    service
0        49
1         6
2        20
3        31
4        18
..      ...
73       10
74        6
75       17
76       14
77       15

[78 rows x 1 columns]

In [418]:
df.reset_index()

    index       rank discipline  phd  service     sex  salary
0       0       Prof          B   56       49    Male  186960
1       1       Prof          A   12        6    Male   93000
2       2       Prof          A   23       20    Male  110515
3       3       Prof          A   40       31    Male  131205
4       4       Prof          B   20       18    Male  104800
..    ...        ...        ...  ...      ...     ...     ...
73     73       Prof          B   18       10  Female  105450
74     74  AssocProf          B   19        6  Female  104542
75     75       Prof          B   17       17  Female  124312
76     76       Prof          A   28       14  Female  109954
77     77       Prof          A   23       15  Female  109646

[78 rows x 7 columns]

In [419]:
df.drop(index = 3)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[77 rows x 6 columns]

In [420]:
df.drop(index = [2,5])

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
6   AssocProf          A   20       17    Male   81285
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[76 rows x 6 columns]

In [421]:
import sqlite3
import pandas as pd

# Create a connection to SQLite in-memory database
con = sqlite3.connect(":memory:")

# Create a cursor object to execute SQL queries
cur = con.cursor()

# Create a sample table
cur.execute('''
    CREATE TABLE employees (
        id INTEGER PRIMARY KEY,
        name TEXT NOT NULL,
        department TEXT NOT NULL,
        salary REAL
    )
''')

# Insert sample data
cur.execute("INSERT INTO employees (name, department, salary) VALUES ('Alice', 'HR', 50000)")
cur.execute("INSERT INTO employees (name, department, salary) VALUES ('Bob', 'Finance', 60000)")
cur.execute("INSERT INTO employees (name, department, salary) VALUES ('Charlie', 'IT', 70000)")

# Commit the changes
con.commit()
# SQL query to retrieve data
query = "SELECT * FROM employees"

# Read the SQL query result into a DataFrame
df = pd.read_sql(query, con)

# Display the DataFrame
print(df)

   id     name department   salary
0   1    Alice         HR  50000.0
1   2      Bob    Finance  60000.0
2   3  Charlie         IT  70000.0

In [432]:
df.at[4, 'rank'] #it can only represent labels non other than values in the columns

'assoc prof'

In [430]:
m = df.at[4, 'rank'] = 'assoc prof'
m

'assoc prof'

In [441]:
df.iat[4, 2]

20

In [469]:
df.iat[2,2] = 55000

In [427]:
df

   id     name department   salary
0   1    Alice         HR  50000.0
1   2      Bob    Finance  60000.0
2   3  Charlie         IT  70000.0

In [447]:
df[df['phd'] > 30]

    rank discipline    phd  service     sex  salary
0   Prof          B     56       49    Male  186960
2   Prof          A  55000       20    Male  110515
3   Prof          A     40       31    Male  131205
9   Prof          A     51       51    Male   57800
10  Prof          B     39       33    Male  128250
13  Prof          B     35       33    Male  162200
21  Prof          A     33       30    Male  103106
25  Prof          B     35       31    Male   99418
26  Prof          A     38       19    Male  148750
27  Prof          A     45       43    Male  155865
36  Prof          B     45       45    Male  146856
40  Prof          A     39       36  Female  137000
58  Prof          B     36       26  Female  144651
65  Prof          A     36       19  Female  117555

In [463]:
df.query('rank == "Prof" and discipline =="A"')

    rank discipline  phd  service     sex  salary
1   Prof          A   12        6    Male   93000
2   Prof          A   23       20    Male  110515
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
8   Prof          A   29       19    Male   94350
9   Prof          A   51       51    Male   57800
18  Prof          A   19        7    Male  107300
19  Prof          A   29       27    Male  150500
21  Prof          A   33       30    Male  103106
24  Prof          A   30       23    Male   91100
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
32  Prof          A   27       19    Male  103275
37  Prof          A   20        8    Male  102000
40  Prof          A   39       36  Female  137000
52  Prof          A   12        0  Female  105000
63  Prof          A   29       27  Female   91000
65  Prof          A   36       19  Female  117555
67  Prof          A   17       11  Female   90450
69  Prof          A   28        7  Female  116450
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [423]:
df.dropna()

   id     name department   salary
0   1    Alice         HR  50000.0
1   2      Bob    Finance  60000.0
2   3  Charlie         IT  70000.0

In [448]:
df.notnull()

    rank  discipline   phd  service   sex  salary
0   True        True  True     True  True    True
1   True        True  True     True  True    True
2   True        True  True     True  True    True
3   True        True  True     True  True    True
4   True        True  True     True  True    True
..   ...         ...   ...      ...   ...     ...
73  True        True  True     True  True    True
74  True        True  True     True  True    True
75  True        True  True     True  True    True
76  True        True  True     True  True    True
77  True        True  True     True  True    True

[78 rows x 6 columns]

In [449]:
df.isnull()

     rank  discipline    phd  service    sex  salary
0   False       False  False    False  False   False
1   False       False  False    False  False   False
2   False       False  False    False  False   False
3   False       False  False    False  False   False
4   False       False  False    False  False   False
..    ...         ...    ...      ...    ...     ...
73  False       False  False    False  False   False
74  False       False  False    False  False   False
75  False       False  False    False  False   False
76  False       False  False    False  False   False
77  False       False  False    False  False   False

[78 rows x 6 columns]

In [450]:
df.fillna('munna')

         rank discipline    phd  service     sex  salary
0        Prof          B     56       49    Male  186960
1        Prof          A     12        6    Male   93000
2        Prof          A  55000       20    Male  110515
3        Prof          A     40       31    Male  131205
4        Prof          B     20       18    Male  104800
..        ...        ...    ...      ...     ...     ...
73       Prof          B     18       10  Female  105450
74  AssocProf          B     19        6  Female  104542
75       Prof          B     17       17  Female  124312
76       Prof          A     28       14  Female  109954
77       Prof          A     23       15  Female  109646

[78 rows x 6 columns]

In [ ]:
import pandas as pd

# Create a sample DataFrame
data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
# Apply a function to each column
result_sum = df.apply(lambda x: x.sum())
print("\nSum of each column:")
print(result_sum)

In [470]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'rank': ['Prof', 'Prof', 'Prof', 'Asst', 'Prof'],
    'discipline': ['B', 'A', 'A', 'B', 'A'],
    'phd': [56, 12, 23, 40, 20],
    'service': [49, 6, 20, 31, 18],
    'sex': ['Male', 'Male', 'Male', 'Male', 'Male'],
    'salary': [186960, 93000, 110515, 131205, 104800]
})

print("Original DataFrame:")
print(df)

# Apply query to filter rows where rank is 'Prof' and discipline is 'A'
result = df.query('rank == "Prof" and discipline == "A"')

print("\nFiltered DataFrame:")
print(result)

Original DataFrame:
   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Asst          B   40       31  Male  131205
4  Prof          A   20       18  Male  104800

Filtered DataFrame:
   rank discipline  phd  service   sex  salary
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
4  Prof          A   20       18  Male  104800

In [451]:
df.drop(index = [1], inplace = False)

         rank discipline    phd  service     sex  salary
0        Prof          B     56       49    Male  186960
2        Prof          A  55000       20    Male  110515
3        Prof          A     40       31    Male  131205
4        Prof          B     20       18    Male  104800
5        Prof          A     20       20    Male  122400
..        ...        ...    ...      ...     ...     ...
73       Prof          B     18       10  Female  105450
74  AssocProf          B     19        6  Female  104542
75       Prof          B     17       17  Female  124312
76       Prof          A     28       14  Female  109954
77       Prof          A     23       15  Female  109646

[77 rows x 6 columns]

In [474]:
df.drop(index = 3)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
4  Prof          A   20       18  Male  104800

In [455]:
import pandas as pd

# Sample DataFrame with a datetime column
data = {
    'Date': ['2024-01-01', '2024-02-15', '2024-03-10']
}

df = pd.DataFrame(data)

# Convert 'Date' column to datetime
df['Date'] = pd.to_datetime(df['Date'])

# Extract year and month from 'Date' column
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['date'] = df['Date'].dt.date
print("\nDataFrame with year and month extracted:")
print(df)

DataFrame with year and month extracted:
        Date  Year  Month        date
0 2024-01-01  2024      1  2024-01-01
1 2024-02-15  2024      2  2024-02-15
2 2024-03-10  2024      3  2024-03-10